# Basic Brewfile
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "python@3.11"
brew "glances"
brew "gnupg"
brew "gping"
brew "lazydocker"
brew "mysql-client"
brew "node"
brew "openblas"
brew "pandoc"
brew "postgresql@14"
cask "iterm2"
cask "macfuse"
cask "clipy"
brew "sevenzip"
brew "neovim"
brew "tmux"
cask "homebrew/cask-fonts"
brew "font-jetbrains-mono-nerd-font"
brew "ripgrep"