# Basic Brewfile
# Note: Most taps are auto-included in modern Homebrew

# Essential system tools
brew "yadm"
brew "git"
brew "starship"
brew "byobu"

# Development tools
brew "python@3.11"
brew "glances"
brew "gnupg"
brew "gping"
brew "lazydocker"
brew "mysql-client"
brew "node"
brew "openblas"
brew "pandoc"
brew "postgresql@14"
cask "iterm2"
cask "macfuse"
cask "clipy"
cask "claude-code"
brew "sevenzip"
brew "neovim"
brew "tmux"
cask "font-jetbrains-mono-nerd-font"
brew "ripgrep"